IDEA Open Model
CrossSectionComponentThermalData.ComponentIndex Property
Compatible with IDEA StatiCa 20.1
 Zero based index of component
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public int ComponentIndex { get; set; }
Public Property ComponentIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CrossSectionComponentThermalData Class
IdeaRS.OpenModel.CrossSection Namespace